Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2025DAL169.atdf
      <value-group caption="DMA Interrupt Enable bit" name="USBDMA4C__DMAIE">
         <value caption="Interrupt is enabled for this channel" name="" value="0x1" />
         <value caption="Interrupt is disabled for this channel" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Error bit" name="USBDMA4C__DMAERR">
         <value caption="A bus error has been observed on the input" name="" value="0x1" />
         <value caption="The software writes this to clear the error" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Burst Mode Selection bit" name="USBDMA4C__DMABRSTM">
         <value caption="Burst Mode 3: INCR16" name="" value="0x3" />
         <value caption="Burst Mode 2: INCR8" name="" value="0x2" />
         <value caption="Burst Mode 1: INCR4 or unspecified length" name="" value="0x1" />
         <value caption="Burst Mode 0: Bursts of unspecified length" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Enable bit" name="USBDMA5C__DMAEN">
         <value caption="Enable the DMA transfer and start the transfer" name="" value="0x1" />
         <value caption="Disable the DMA transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Transfer Direction bit" name="USBDMA5C__DMADIR">
         <value caption="DMA Read (TX endpoint)" name="" value="0x1" />
         <value caption="DMA Write (RX endpoint)" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Transfer Mode bit" name="USBDMA5C__DMAMODE">
         <value caption="DMA Mode1 Transfers" name="" value="0x1" />
         <value caption="DMA Mode0 Transfers" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Interrupt Enable bit" name="USBDMA5C__DMAIE">
         <value caption="Interrupt is enabled for this channel" name="" value="0x1" />
         <value caption="Interrupt is disabled for this channel" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Error bit" name="USBDMA5C__DMAERR">
         <value caption="A bus error has been observed on the input" name="" value="0x1" />
         <value caption="The software writes this to clear the error" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Burst Mode Selection bit" name="USBDMA5C__DMABRSTM">
         <value caption="Burst Mode 3: INCR16" name="" value="0x3" />
         <value caption="Burst Mode 2: INCR8" name="" value="0x2" />
         <value caption="Burst Mode 1: INCR4 or unspecified length" name="" value="0x1" />
         <value caption="Burst Mode 0: Bursts of unspecified length" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Enable bit" name="USBDMA6C__DMAEN">
         <value caption="Enable the DMA transfer and start the transfer" name="" value="0x1" />
         <value caption="Disable the DMA transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Transfer Direction bit" name="USBDMA6C__DMADIR">
         <value caption="DMA Read (TX endpoint)" name="" value="0x1" />
         <value caption="DMA Write (RX endpoint)" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Transfer Mode bit" name="USBDMA6C__DMAMODE">
         <value caption="DMA Mode1 Transfers" name="" value="0x1" />
         <value caption="DMA Mode0 Transfers" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Interrupt Enable bit" name="USBDMA6C__DMAIE">
         <value caption="Interrupt is enabled for this channel" name="" value="0x1" />
         <value caption="Interrupt is disabled for this channel" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Error bit" name="USBDMA6C__DMAERR">
         <value caption="A bus error has been observed on the input" name="" value="0x1" />
         <value caption="The software writes this to clear the error" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Burst Mode Selection bit" name="USBDMA6C__DMABRSTM">
         <value caption="Burst Mode 3: INCR16" name="" value="0x3" />
         <value caption="Burst Mode 2: INCR8" name="" value="0x2" />
         <value caption="Burst Mode 1: INCR4 or unspecified length" name="" value="0x1" />
         <value caption="Burst Mode 0: Bursts of unspecified length" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Enable bit" name="USBDMA7C__DMAEN">
         <value caption="Enable the DMA transfer and start the transfer" name="" value="0x1" />
         <value caption="Disable the DMA transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Transfer Direction bit" name="USBDMA7C__DMADIR">
         <value caption="DMA Read (TX endpoint)" name="" value="0x1" />
         <value caption="DMA Write (RX endpoint)" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Transfer Mode bit" name="USBDMA7C__DMAMODE">
         <value caption="DMA Mode1 Transfers" name="" value="0x1" />
         <value caption="DMA Mode0 Transfers" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Interrupt Enable bit" name="USBDMA7C__DMAIE">
         <value caption="Interrupt is enabled for this channel" name="" value="0x1" />
         <value caption="Interrupt is disabled for this channel" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Error bit" name="USBDMA7C__DMAERR">
         <value caption="A bus error has been observed on the input" name="" value="0x1" />
         <value caption="The software writes this to clear the error" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Burst Mode Selection bit" name="USBDMA7C__DMABRSTM">
         <value caption="Burst Mode 3: INCR16" name="" value="0x3" />
         <value caption="Burst Mode 2: INCR8" name="" value="0x2" />
         <value caption="Burst Mode 1: INCR4 or unspecified length" name="" value="0x1" />
         <value caption="Burst Mode 0: Bursts of unspecified length" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Enable bit" name="USBDMA8C__DMAEN">
         <value caption="Enable the DMA transfer and start the transfer" name="" value="0x1" />
         <value caption="Disable the DMA transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Transfer Direction bit" name="USBDMA8C__DMADIR">
         <value caption="DMA Read (TX endpoint)" name="" value="0x1" />
         <value caption="DMA Write (RX endpoint)" name="" value="0x0" />
      </value-group>
